Revit 2027 API
ExportLineweightKey(Int32) Constructor
 Constructs a new default ExportLineweightKey using the original line weight as input.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ExportLineweightKey(
	int originalLineweight
)
Public Sub New (
	originalLineweight As Integer
)
public:
ExportLineweightKey(
	int originalLineweight
)
new :
        originalLineweight : int -> ExportLineweightKey
Parameters
originalLineweight Int32
 The original line weight.
See Also
Reference
ExportLineweightKey Class
ExportLineweightKey Overload
Autodesk.Revit.DB Namespace